In [1]:
import pandas as pd

In [2]:
# import pandas as pd

columns = ['Name', 'Age', 'Height']
df = pd.DataFrame(columns=columns)
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ['Allen', '22', '175']
df.loc[1] = ['Jack', '25', '180']
df.loc[2] = ['Mike', '23', '170']
df

    Name Age Height
0  Allen  22    175
1   Jack  25    180
2   Mike  23    170

In [4]:
df['weight'] = ['75', '80', '60']
df

    Name Age Height weight
0  Allen  22    175     75
1   Jack  25    180     80
2   Mike  23    170     60

In [5]:
df = df.drop(['weight'], axis=1) # 此時才真正被刪除
df

    Name Age Height
0  Allen  22    175
1   Jack  25    180
2   Mike  23    170

In [6]:
df = (df.drop(1))
df

    Name Age Height
0  Allen  22    175
2   Mike  23    170

In [7]:
df["Age"][2]

'23'

In [8]:
df["Age"][2] = 50
df

    Name Age Height
0  Allen  22    175
2   Mike  50    170

In [9]:
df['Age'] = 28
df

    Name  Age Height
0  Allen   28    175
2   Mike   28    170

In [10]:
data = [
    ["Allen", 175, 22],
    ["Ted", 180, 25]
]
df2 = pd.DataFrame(data=data, columns=columns)
df2

    Name  Age  Height
0  Allen  175      22
1    Ted  180      25

In [11]:
df

    Name  Age Height
0  Allen   28    175
2   Mike   28    170

In [14]:
df3 = pd.concat([df, df2])
df3

    Name  Age Height
0  Allen   28    175
2   Mike   28    170
0  Allen  175     22
1    Ted  180     25

In [15]:
df3.reset_index()

   index   Name  Age Height
0      0  Allen   28    175
1      2   Mike   28    170
2      0  Allen  175     22
3      1    Ted  180     25

In [18]:
df3 = df3.reset_index(drop=True)
df3

    Name  Age Height
0  Allen   28    175
1   Mike   28    170
2  Allen  175     22
3    Ted  180     25

In [19]:
df3['Name']

0    Allen
1     Mike
2    Allen
3      Ted
Name: Name, dtype: object